#![no_std]  // Отключает линковку со стандартной библиотекой Rust (std) — доступен только core.
#![no_main] // Отключает автогенерацию точки входа Rust — точку входа определим сами.
#![windows_subsystem = "console"] // Указывает Windows, что это консольное приложение

use core::ffi::c_void ; // Импорт C-совместимого void-типа для указателей в FFI (эквивалент C void*).
use core::panic::PanicInfo ; // Импорт структуры с информацией о панике (файл, строка, сообщение).
use windows_sys::Win32::System::Console::{  // Импорт функций и констант для работы с консолью Windows.
            GetStdHandle, // Функция получения дескриптора стандартного устройства (stdin/stdout/stderr).
            WriteConsoleA, // Функция записи ANSI-строки в консоль.
            STD_OUTPUT_HANDLE // Константа, обозначающая дескриптор стандартного вывода (stdout).
        } ;
use windows_sys::Win32::System::Threading::ExitProcess ; // Импорт функции завершения текущего процесса с кодом.

#[cfg(not(test))]   // Атрибут условной компиляции: код ниже исключается при сборке тестов (чтобы не конфликтовать со std).
/*
Компилирует следующий элемент только тогда, когда сборка выполняется не в режиме тестирования. 
При cargo test Rust подключает тестовую инфраструктуру на базе std, где уже есть собственный обработчик паники. 
Это помогает избежать конфликта обработчиков.
*/
#[panic_handler]    // Атрибут, помечающий функцию как обработчик паники (обязателен в no_std).
fn panic(_: &PanicInfo<'_>) -> ! {  // Функция-обработчик паники; возвращает ! (never type) — не возвращает управление.
    unsafe {
        ExitProcess(1)  // Завершаем процесс с кодом ошибки 1 (сигнал о панике).
    }
}

#[allow(non_snake_case)]    // Отключает предупреждение о не-snake_case имени (mainCRTStartup — стандартное имя).
#[unsafe(no_mangle)]    // В Rust 2024 — запрещает искажение имени функции, чтобы линкер нашёл его как mainCRTStartup.
fn mainCRTStartup() -> ! {   // Точка входа для консольного приложения Windows; возвращает ! — не возвращает управление.
    let message = "Hello, world!\n";
    
    unsafe {
        // Получаем дескриптор стандартного вывода.
        let console = GetStdHandle(STD_OUTPUT_HANDLE);
        
        WriteConsoleA(  // Вызов функции записи ANSI-строки в консоль.
            console,    // Дескриптор stdout
            message
                        .as_ptr()   // не изменяемый сырой указатель
                        .cast::<c_void>(),  // приводи к указателю *const c_void
            message.len() as u32,   // Длина строки в байтах, приведённая к u32
            core::ptr::null_mut(),  // Указатель для получения числа записанных символов — null (не нужен).
            core::ptr::null(),  // Зарезервированный параметр — null (должен быть null по документации).
        );
        
        ExitProcess(0)  // Завершаем процесс с кодом успеха 0.
    }
}
